crosscon/crosscon_puf_authentication/LPC55S69_PAVOC/source/LPC55S69_PAVOC.c
/*
 * Copyright 2016-2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/**
 * @file    LPC55S69_PAVOC.c
 * @brief   Application entry point.
 */
#include <stdio.h>
#include "board.h"
#include "peripherals.h"
#include "pin_mux.h"
#include "clock_config.h"
#include "LPC55S69_cm33_core0.h"
#include "fsl_debug_console.h"
#include "mbedtls/sha256.h"
#include "mbedtls/md.h"
#include "mbedtls/md_internal.h"
#include "core_json.h"
/* TODO: insert other include files here. */

/* TODO: insert other definitions and declarations here. */

/*
 * @brief   Application entry point.
 */



void hex_to_bytes_array(char* src, uint8_t* dest, size_t count) {
  size_t i;
  int value;
  for (i = 0; i < count && sscanf(src + i * 2, "%2x", &value) == 1; i++) {
        dest[i] = value;
    }
}

void calc_sha_256(uint8_t output[], const uint8_t* input, size_t len) {
	size_t outlen = 32;
	//HASHCRYPT_SHA(HASHCRYPT, kHASHCRYPT_Sha256, input, len, output, &outlen);

	mbedtls_sha256_context sha256_ctx;
	mbedtls_sha256_init(&sha256_ctx);
	mbedtls_sha256_starts_ret(&sha256_ctx, 0);
		//size_t len = strlen(input);
		//unsigned char* start = (unsigned char*)input;
	mbedtls_sha256_update_ret(&sha256_ctx, input, len);
	mbedtls_sha256_finish_ret(&sha256_ctx, output);

	mbedtls_sha256_free(&sha256_ctx);

}

void puf(uint8_t challenge[32], uint8_t response[32]) {

	calc_sha_256(response, challenge, 32);
}

//char* get_path_for_ID(ID, &path_length) {

//}

int verify_inclusion(char *path_json, size_t path_length, uint8_t root[32], uint8_t leaf[32]) {
	/*
    unsigned long st,end;
    enableCycleCounter();
    resetCycleCounter();
    st = getCycleCount();
	char URL_base[] = "GET /%s/%s HTTP/1.0\r\n\r\n";

	char decoded[64];
	for (int i = 0; i < 32; i++) {

	 	sprintf(decoded+2*i, "%02x", (unsigned char) leaf[i]);
	}
	char URL[130];
	int ret = snprintf(URL, sizeof(URL), "GET /%s/%s HTTP/1.0\r\n\r\n", ID, decoded);
	int start;
	unsigned long str = getCycleCount();
    char *res = make_http_get(URL, &start, 8080);
	//char*res="{\"rule\":[1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0],\"path\":[\"fa61e3dec3439589f4784c893bf321d0084f04c572c7af2b68e3f3360a35b486\",\"2215e8ac4e2b871c2a48189e79738c956c081e23ac2f2415bf77da199dfd920c\",\"9c769ac26f8d61ff40859e5201537845555136f0fd7ab604f7033180fbe76af9\",\"fed7af7d64bf0a73fcad018df1219928dbafa4d96b5d78f8a5e9be66ff0ada38\",\"71d342ff7b54e15d39476b5cc2eac3b09621868016ee4e21635e776ac28dadbc\",\"6d87aa1b1e3855a002cd3d72dce70ce40a828c546069fed0a4bc97a5b597acf5\",\"6e6b14417ca128c657b2dd44db66112fa6a09297b3886ecdc8222f4527111e47\",\"082a40cb92879b9c576e2890b72f6f73d707e27f25c347f3b28509e84afbb181\",\"1cf12d69cdf89af085bbdef9033d9c79bfdc07bf2a75d43123ee0c77a2622542\",\"8077b079e0203013ca1b4737d20c855f183d9656eac7d3f6591fcadcd0d94c4c\",\"2a50d29c0b861ca11325871af50fcdde90f34426cc29366c52af48a0ad252dc9\",\"75de48a7bf707bde0b211396f651b5da5c12ecc0a889d3d13037cff6128ef9c4\",\"1edfae98a5d985dcfc0e24ca03040c29cef0732dd48be7c09bb4a771f0d29837\",\"03236d2093689e47a2694ce5906a93b73385b17e0c3f86212303dd5494ea4fb6\",\"548b6523b76a4013a84e7f96f2853922e1d338120cf4c599a5e40d8b602fad72\",\"1ef2a8e2a113be8d536a0ec6ffca6e54dfe25be8f1efbd4143fb3dacbdea41dd\",\"5e1500f0cd72b71b99ff0fab608e88c04f6519b23518e0b5226c9036370f9337\",\"585ca3d3b620b812b39f8d05ccf38be6604d5c3d2f5a75b3f767169a6023b273\",\"7e4ecc78b94ff42ca8e170ad3a468882d530dc462fcdf21471e662a71503ceb6\",\"212f9bc2c3c3577916f85d369207ece912b540d7c643d05d1d957e5cc5ef011d\",\"3023225890c2d7185ea737481a2a5be851723f1a5358ae0da84771e1a9b38fde\",\"d2d17c51dbf7c6115d5af7eec92fb5f03d6b1441659e5e97ccfc28dd914c60b9\",\"2a0b07b71e3f7c6574c30553d5d9c9af66c9a46efd8d215def71393d2863f036\",\"c12c0a6f85507f0403be0a4279d0cdcf660a6f42e306a79220232d39189516d9\",\"00fc55677dac4968954d5881b1cd870988d665f5c17f7b91c54e86e97e5d9664\",\"49807838fd96820043834f79139e781f36929c4d1016dad1b17bf8e4251a5cba\"]}";
	//char *res = "{\"rule\": [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], \"path\": [\"fa61e3dec3439589f4784c893bf321d0084f04c572c7af2b68e3f3360a35b486\", \"2215e8ac4e2b871c2a48189e79738c956c081e23ac2f2415bf77da199dfd920c\", \"9c769ac26f8d61ff40859e5201537845555136f0fd7ab604f7033180fbe76af9\", \"fed7af7d64bf0a73fcad018df1219928dbafa4d96b5d78f8a5e9be66ff0ada38\", \"71d342ff7b54e15d39476b5cc2eac3b09621868016ee4e21635e776ac28dadbc\", \"6d87aa1b1e3855a002cd3d72dce70ce40a828c546069fed0a4bc97a5b597acf5\", \"6e6b14417ca128c657b2dd44db66112fa6a09297b3886ecdc8222f4527111e47\", \"082a40cb92879b9c576e2890b72f6f73d707e27f25c347f3b28509e84afbb181\", \"1cf12d69cdf89af085bbdef9033d9c79bfdc07bf2a75d43123ee0c77a2622542\", \"8077b079e0203013ca1b4737d20c855f183d9656eac7d3f6591fcadcd0d94c4c\", \"2a50d29c0b861ca11325871af50fcdde90f34426cc29366c52af48a0ad252dc9\", \"75de48a7bf707bde0b211396f651b5da5c12ecc0a889d3d13037cff6128ef9c4\", \"1edfae98a5d985dcfc0e24ca03040c29cef0732dd48be7c09bb4a771f0d29837\", \"03236d2093689e47a2694ce5906a93b73385b17e0c3f86212303dd5494ea4fb6\", \"548b6523b76a4013a84e7f96f2853922e1d338120cf4c599a5e40d8b602fad72\", \"1ef2a8e2a113be8d536a0ec6ffca6e54dfe25be8f1efbd4143fb3dacbdea41dd\", \"5e1500f0cd72b71b99ff0fab608e88c04f6519b23518e0b5226c9036370f9337\", \"585ca3d3b620b812b39f8d05ccf38be6604d5c3d2f5a75b3f767169a6023b273\", \"7e4ecc78b94ff42ca8e170ad3a468882d530dc462fcdf21471e662a71503ceb6\", \"212f9bc2c3c3577916f85d369207ece912b540d7c643d05d1d957e5cc5ef011d\", \"3023225890c2d7185ea737481a2a5be851723f1a5358ae0da84771e1a9b38fde\", \"d2d17c51dbf7c6115d5af7eec92fb5f03d6b1441659e5e97ccfc28dd914c60b9\", \"2a0b07b71e3f7c6574c30553d5d9c9af66c9a46efd8d215def71393d2863f036\", \"c12c0a6f85507f0403be0a4279d0cdcf660a6f42e306a79220232d39189516d9\", \"00fc55677dac4968954d5881b1cd870988d665f5c17f7b91c54e86e97e5d9664\", \"49807838fd96820043834f79139e781f36929c4d1016dad1b17bf8e4251a5cba\"]}\0";
			//"{rule: [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], path: ['fa61e3dec3439589f4784c893bf321d0084f04c572c7af2b68e3f3360a35b486', '2215e8ac4e2b871c2a48189e79738c956c081e23ac2f2415bf77da199dfd920c', '9c769ac26f8d61ff40859e5201537845555136f0fd7ab604f7033180fbe76af9', 'fed7af7d64bf0a73fcad018df1219928dbafa4d96b5d78f8a5e9be66ff0ada38', '71d342ff7b54e15d39476b5cc2eac3b09621868016ee4e21635e776ac28dadbc', '6d87aa1b1e3855a002cd3d72dce70ce40a828c546069fed0a4bc97a5b597acf5', '6e6b14417ca128c657b2dd44db66112fa6a09297b3886ecdc8222f4527111e47', '082a40cb92879b9c576e2890b72f6f73d707e27f25c347f3b28509e84afbb181', '1cf12d69cdf89af085bbdef9033d9c79bfdc07bf2a75d43123ee0c77a2622542', '8077b079e0203013ca1b4737d20c855f183d9656eac7d3f6591fcadcd0d94c4c', '2a50d29c0b861ca11325871af50fcdde90f34426cc29366c52af48a0ad252dc9', '75de48a7bf707bde0b211396f651b5da5c12ecc0a889d3d13037cff6128ef9c4', '1edfae98a5d985dcfc0e24ca03040c29cef0732dd48be7c09bb4a771f0d29837', '03236d2093689e47a2694ce5906a93b73385b17e0c3f86212303dd5494ea4fb6', '548b6523b76a4013a84e7f96f2853922e1d338120cf4c599a5e40d8b602fad72', '1ef2a8e2a113be8d536a0ec6ffca6e54dfe25be8f1efbd4143fb3dacbdea41dd', '5e1500f0cd72b71b99ff0fab608e88c04f6519b23518e0b5226c9036370f9337', '585ca3d3b620b812b39f8d05ccf38be6604d5c3d2f5a75b3f767169a6023b273', '7e4ecc78b94ff42ca8e170ad3a468882d530dc462fcdf21471e662a71503ceb6', '212f9bc2c3c3577916f85d369207ece912b540d7c643d05d1d957e5cc5ef011d', '3023225890c2d7185ea737481a2a5be851723f1a5358ae0da84771e1a9b38fde', 'd2d17c51dbf7c6115d5af7eec92fb5f03d6b1441659e5e97ccfc28dd914c60b9', '2a0b07b71e3f7c6574c30553d5d9c9af66c9a46efd8d215def71393d2863f036', 'c12c0a6f85507f0403be0a4279d0cdcf660a6f42e306a79220232d39189516d9', '00fc55677dac4968954d5881b1cd870988d665f5c17f7b91c54e86e97e5d9664', '49807838fd96820043834f79139e781f36929c4d1016dad1b17bf8e4251a5cba']}\0";
			//"{'rule': [1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], 'path': ['fa61e3dec3439589f4784c893bf321d0084f04c572c7af2b68e3f3360a35b486', '2215e8ac4e2b871c2a48189e79738c956c081e23ac2f2415bf77da199dfd920c", "9c769ac26f8d61ff40859e5201537845555136f0fd7ab604f7033180fbe76af9", "fed7af7d64bf0a73fcad018df1219928dbafa4d96b5d78f8a5e9be66ff0ada38", "71d342ff7b54e15d39476b5cc2eac3b09621868016ee4e21635e776ac28dadbc", "6d87aa1b1e3855a002cd3d72dce70ce40a828c546069fed0a4bc97a5b597acf5", "6e6b14417ca128c657b2dd44db66112fa6a09297b3886ecdc8222f4527111e47", "082a40cb92879b9c576e2890b72f6f73d707e27f25c347f3b28509e84afbb181", "1cf12d69cdf89af085bbdef9033d9c79bfdc07bf2a75d43123ee0c77a2622542", "8077b079e0203013ca1b4737d20c855f183d9656eac7d3f6591fcadcd0d94c4c", "2a50d29c0b861ca11325871af50fcdde90f34426cc29366c52af48a0ad252dc9", "75de48a7bf707bde0b211396f651b5da5c12ecc0a889d3d13037cff6128ef9c4", "1edfae98a5d985dcfc0e24ca03040c29cef0732dd48be7c09bb4a771f0d29837", "03236d2093689e47a2694ce5906a93b73385b17e0c3f86212303dd5494ea4fb6", "548b6523b76a4013a84e7f96f2853922e1d338120cf4c599a5e40d8b602fad72", "1ef2a8e2a113be8d536a0ec6ffca6e54dfe25be8f1efbd4143fb3dacbdea41dd", "5e1500f0cd72b71b99ff0fab608e88c04f6519b23518e0b5226c9036370f9337", "585ca3d3b620b812b39f8d05ccf38be6604d5c3d2f5a75b3f767169a6023b273", "7e4ecc78b94ff42ca8e170ad3a468882d530dc462fcdf21471e662a71503ceb6", "212f9bc2c3c3577916f85d369207ece912b540d7c643d05d1d957e5cc5ef011d", "3023225890c2d7185ea737481a2a5be851723f1a5358ae0da84771e1a9b38fde", "d2d17c51dbf7c6115d5af7eec92fb5f03d6b1441659e5e97ccfc28dd914c60b9", "2a0b07b71e3f7c6574c30553d5d9c9af66c9a46efd8d215def71393d2863f036", "c12c0a6f85507f0403be0a4279d0cdcf660a6f42e306a79220232d39189516d9", "00fc55677dac4968954d5881b1cd870988d665f5c17f7b91c54e86e97e5d9664", "49807838fd96820043834f79139e781f36929c4d1016dad1b17bf8e4251a5cba"]}';
	start = 0;
	if(res == NULL) {
    		return;
    	}
    PRINTF("http get: %u, ", getCycleCount() - str);
    */
	char rule[] = "rule";
    size_t ruleLength = sizeof( rule ) - 1;
    char path[] = "path";
    size_t pathLength = sizeof ( path ) - 1;
    char * rule_value;
    size_t rule_valueLength;
    char * path_value;
    size_t path_valueLength;
            // Calling JSON_Validate() is not necessary if the document is guaranteed to be valid.
   // result = JSON_Validate( buffer2, bufferLength );

