crosscon/crosscon_puf_authentication/LPC55S69_PAVOC/source/LPC55S69_PAVOC.c
    JSONStatus_t result;
    result = JSON_Validate(path_json, path_length);

    if( result == JSONSuccess )
    {
        // result = JSON_Search( buffer2, bufferLength, query, queryLength,
        //                              &value, &valueLength );
   	 result = JSON_Search(path_json, path_length, rule, ruleLength, &rule_value, &rule_valueLength);
   	 result = JSON_Search(path_json, path_length, path, pathLength, &path_value, &path_valueLength);
     }

    if( result == JSONSuccess )
    {
                // The pointer "value" will point to a location in the "buffer".
          //char save = rule_value[ rule_valueLength ];
                // After saving the character, set it to a null byte for printing.
        /* char helper[rule_valueLength];
         memcpy(helper, rule_value, rule_valueLength);
    	 rule_value[ rule_valueLength ] = '\0';
                // "Found: bar.foo -> xyz" will be printed.
          //PRINTF( "Found: %s -> %s\n", rule, rule_value );
                // Restore the original character.
                //value[ valueLength ] = save;

          //char save = path_value[ path_valueLength ];
                // After saving the character, set it to a null byte for printing.
          path_value[ path_valueLength ] = '\0';
                // "Found: bar.foo -> xyz" will be printed.
          //PRINTF( "Found: %s -> %s\n", path, path_value );
           *
           */
      }

    int rule_Length = (rule_valueLength-1) / 2;
    int path_Length = (path_valueLength-1) / 65;
    uint8_t rule_res [rule_Length];
    uint8_t path_res [path_Length][32];


    int idx = 1;
    int i;
    for(i = 0; i < rule_Length; i++) {
   	 rule_res[i] = *(rule_value + idx) - '0';
   	 idx = idx + 2;
    }
    path_value += 2;
    for(i = 0; i < path_Length - 1; i++) {

   	 hex_to_bytes_array(path_value, path_res[i], 64);
   	 path_value += 67;
    }
    hex_to_bytes_array(path_value, path_res[path_Length - 1], 64);
    //PRINTF("rest: %u, ", getCycleCount() - st);
    //uint8_t root2[32];
    //unsigned long st,end;
    //enableCycleCounter();
    //resetCycleCounter();
    	//st = getCycleCount();
    if (memcmp(leaf, path_res[0], 32) != 0) {
      	return 1;
      }
    int res = verify_path(rule_res, path_res, rule_Length, root);
    	//if (result == 0) {
    		//PRINTF("%u, ", getCycleCount() - st);
    	//}
    	//resetCycleCounter();
    return res;
}




int verify_path(uint8_t rules[], uint8_t path[][32], size_t len, uint8_t root[]) {


	uint8_t res[32];
	int index = 0;
	uint8_t bit = rules[0];
	uint8_t input[65];
	uint8_t digest[32];
	memcpy(res, path[0], 32);
	while (index < len - 1)
	{
		uint8_t next_bit = rules[index+1];
		memcpy(digest, path[index + 1], 32);
		//hex_to_bytes_array(path1[index+1], digest, strlen(path1[index+1]));
	        //memcpy(digest, path1[index+1], strlen(digest));
	        //memcpy(input, res, 32);
	        //memcpy(input[32], path[index], 32);

		switch (bit) {
	        case 0:
	            memset(input, 0x01, 1);
	            memcpy(input + 1 , res, 32);
	            memcpy(input + 33, digest, 32);
	            calc_sha_256(res, input, 65 );
	            break;
	        case 1:
	            memset(input, 0x01, 1);
	            memcpy(input + 1, digest, 32);
	            memcpy(input + 33, res, 32);
	            calc_sha_256(res, input, 65 );
	            break;
	        default:
	            break;
	        }
	        bit = next_bit;
	        index++;
	    }
	if(memcmp(root, res, 32) == 0) {
		return 0;
	}
	return 1;
}

void generateHashChain(uint8_t start[32], int len, uint8_t res[32]) {
	uint8_t buffer[32];
	uint8_t* input = (uint8_t *)start;
	for(int i = 0; i < len; i++) {
		calc_sha_256(buffer, input, 32);
		input = buffer;
	}
	memcpy(res, buffer, 32);
}

void generateMAC(unsigned char *message, size_t message_length, unsigned char output[], unsigned char *key) {

	 mbedtls_md_context_t ctx;
	 const mbedtls_md_info_t *info;
	 info = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);
	 mbedtls_md_init(&ctx);
	 int res = mbedtls_md_setup(&ctx, info, 1);
	 res = mbedtls_md_hmac_starts(&ctx, key, 32);
	 res = mbedtls_md_hmac_update(&ctx, message, message_length);
	 res = mbedtls_md_hmac_finish(&ctx, output);
	 mbedtls_md_free(&ctx);

}

void authenticate(uint8_t challenge[32], int time_step, uint8_t *msg, int message_length, uint8_t mac[32]){

	uint8_t response[32];
	uint8_t chain_element[32];
	puf(challenge, response);
	generateHashChain(response, time_step, chain_element);
	generateMAC(msg, message_length, mac, chain_element);
}

int verify(uint8_t chain_element[32], int time_step, uint8_t *msg, int message_length, uint8_t mac[32], uint8_t ID[32], char *path, size_t path_length) {

	uint8_t mac_check[32];
	generateMAC(msg, message_length, mac_check, chain_element);
	if(memcmp(mac, mac_check, 32) != 0) {
		return 1;
	}
	uint8_t chain_end[33];
	uint8_t leaf[32];
	memset(chain_end, 0, 33);
	generateHashChain(chain_element, time_step, chain_end + 1);
	calc_sha_256(leaf, chain_end, 33);
	int res;
	res = verify_inclusion(path, path_length, ID, leaf);
	return res;
}

void enroll(int responses_to_enroll, uint8_t result[][32], uint8_t challenges[][32], int chain_length[] ) {

	for (int i=0; i<responses_to_enroll;i++){
		uint8_t puf_response[32];
		puf(challenges[i], puf_response);
		generateHashChain(puf_response, chain_length[i], result[i]);
	}
}


void revealChainElement(uint8_t challenge[32], uint8_t chain_element[32], int time_step) {

	uint8_t puf_response[32];
	puf(challenge, puf_response);
	generateHashChain(puf_response, time_step, chain_element);
}




int main(void) {

    /* Init board hardware. */
    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitBootPeripherals();
#ifndef BOARD_INIT_DEBUG_CONSOLE_PERIPHERAL
    /* Init FSL debug console. */
    BOARD_InitDebugConsole();
#endif
    HASHCRYPT_Init(HASHCRYPT);

    uint8_t challenges[8][32] = {
        {0x1a, 0x2b, 0x3c, 0x4d, 0x5e, 0x6f, 0x70, 0x81, 0x92, 0xa3, 0xb4, 0xc5, 0xd6, 0xe7, 0xf8, 0x09,
         0x1a, 0x2b, 0x3c, 0x4d, 0x5e, 0x6f, 0x70, 0x81, 0x92, 0xa3, 0xb4, 0xc5, 0xd6, 0xe7, 0xf8, 0x09},
        {0xf0, 0xe1, 0xd2, 0xc3, 0xb4, 0xa5, 0x96, 0x87, 0x78, 0x69, 0x5a, 0x4b, 0x3c, 0x2d, 0x1e, 0x0f,
         0xf0, 0xe1, 0xd2, 0xc3, 0xb4, 0xa5, 0x96, 0x87, 0x78, 0x69, 0x5a, 0x4b, 0x3c, 0x2d, 0x1e, 0x0f},
        {0x12, 0x34, 0x56, 0x78, 0x9a, 0xbc, 0xde, 0xf0, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88,
         0x99, 0xaa, 0xbb, 0xcc, 0xdd, 0xee, 0xff, 0x00, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88},
        {0xab, 0xcd, 0xef, 0x01, 0x23, 0x45, 0x67, 0x89, 0xab, 0xcd, 0xef, 0x01, 0x23, 0x45, 0x67, 0x89,
         0xab, 0xcd, 0xef, 0x01, 0x23, 0x45, 0x67, 0x89, 0xab, 0xcd, 0xef, 0x01, 0x23, 0x45, 0x67, 0x89},
        {0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0d, 0x0e, 0x0f,
         0x10, 0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18, 0x19, 0x1a, 0x1b, 0x1c, 0x1d, 0x1e, 0x1f},
        {0x1f, 0x1e, 0x1d, 0x1c, 0x1b, 0x1a, 0x19, 0x18, 0x17, 0x16, 0x15, 0x14, 0x13, 0x12, 0x11, 0x10,
         0x0f, 0x0e, 0x0d, 0x0c, 0x0b, 0x0a, 0x09, 0x08, 0x07, 0x06, 0x05, 0x04, 0x03, 0x02, 0x01, 0x00},
        {0xaa, 0xbb, 0xcc, 0xdd, 0xee, 0xff, 0x00, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88, 0x99,
         0xaa, 0xbb, 0xcc, 0xdd, 0xee, 0xff, 0x00, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66, 0x77, 0x88, 0x99},
        {0x99, 0x88, 0x77, 0x66, 0x55, 0x44, 0x33, 0x22, 0x11, 0x00, 0xff, 0xee, 0xdd, 0xcc, 0xbb, 0xaa,
         0x99, 0x88, 0x77, 0x66, 0x55, 0x44, 0x33, 0x22, 0x11, 0x00, 0xff, 0xee, 0xdd, 0xcc, 0xbb, 0xaa}
    };

    uint8_t responses[8][32];
    int chain_length[8] = {10, 20, 30, 40, 50, 80, 90, 100};

    uint8_t msg[] = "Hello CROSSCON!";
    uint8_t mac[32];
    enroll(8, responses, challenges, chain_length);

